### Terraform Plan - `stage` 환경

<details>
<summary>📋 Plan 결과 보기</summary>

```terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.mgmt[0]: Reading...
module.rds.random_id.secret_suffix: Refreshing state... [id=k0yfYQ]
module.rds.random_password.master: Refreshing state... [id=none]
data.aws_eks_cluster.main: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_region.current: Reading...
module.ecr.aws_ecr_repository.main["dashboard"]: Refreshing state... [id=kyeol-stage-dashboard]
module.rds.aws_secretsmanager_secret.rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:827913617839:secret:kyeol-stage-rds-creds-934c9f61-raBX7Z]
module.eks.aws_iam_role.cluster: Refreshing state... [id=kyeol-stage-eks-cluster-role]
module.vpc.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.ecr.aws_ecr_repository.main["api"]: Refreshing state... [id=kyeol-stage-api]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-0ad4a01d15661ef1c]
module.s3_phase3[0].aws_s3_bucket.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket.media[0]: Refreshing state... [id=kyeol-stage-media]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=827913617839]
module.ecr.aws_ecr_repository.main["storefront"]: Refreshing state... [id=kyeol-stage-storefront]
data.aws_eks_cluster.main: Read complete after 1s [id=kyeol-stage-eks]
module.eks.aws_iam_role.node_group: Refreshing state... [id=kyeol-stage-eks-node-role]
data.aws_eks_cluster_auth.main: Reading...
data.aws_eks_cluster_auth.main: Read complete after 0s [id=kyeol-stage-eks]
module.s3_phase3[0].data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.eks.aws_cloudwatch_log_group.containers: Refreshing state... [id=/aws/eks/kyeol-stage-eks/containers]
module.s3_phase3[0].data.aws_caller_identity.current: Read complete after 0s [id=827913617839]
module.rds.aws_db_parameter_group.main: Refreshing state... [id=kyeol-stage-rds-pg16]
module.eks.aws_iam_role_policy_attachment.cluster_vpc_resource_controller: Refreshing state... [id=kyeol-stage-eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSVPCResourceController]
module.eks.aws_iam_role_policy_attachment.cluster_policy: Refreshing state... [id=kyeol-stage-eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.ecr.aws_ecr_lifecycle_policy.main["storefront"]: Refreshing state... [id=kyeol-stage-storefront]
module.ecr.aws_ecr_lifecycle_policy.main["api"]: Refreshing state... [id=kyeol-stage-api]
module.ecr.aws_ecr_lifecycle_policy.main["dashboard"]: Refreshing state... [id=kyeol-stage-dashboard]
module.eks.aws_iam_role_policy_attachment.node_cloudwatch: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy]
module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.eks.aws_iam_role_policy_attachment.node_ecr: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks.aws_iam_role_policy_attachment.node_worker: Refreshing state... [id=kyeol-stage-eks-node-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
data.terraform_remote_state.mgmt[0]: Read complete after 2s
module.vpc_peering_mgmt[0].data.aws_route_tables.requester: Reading...
module.vpc_peering_mgmt[0].data.aws_route_tables.requester: Read complete after 1s [id=ap-northeast-2]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-084b40988ed914a0a"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-0f469955ce9f75a5b"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-07babae8b6efcdce7"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-000b539ccd4cb4e50"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-084b40988ed914a0a"]: Read complete after 0s [id=rtb-084b40988ed914a0a]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-027538cc4e9d0f5e8]
module.vpc.aws_security_group.alb: Refreshing state... [id=sg-0e579f0e074f80b15]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b847a4edf9d94f2d]
module.vpc_peering_mgmt[0].data.aws_route_tables.accepter: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-07babae8b6efcdce7"]: Read complete after 0s [id=rtb-07babae8b6efcdce7]
module.eks.aws_security_group.cluster: Refreshing state... [id=sg-07bfe205124c446aa]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-000b539ccd4cb4e50"]: Read complete after 0s [id=rtb-000b539ccd4cb4e50]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection.main: Refreshing state... [id=pcx-0ae6e5066e4b085d3]
module.vpc_peering_mgmt[0].data.aws_route_table.requester["rtb-0f469955ce9f75a5b"]: Read complete after 0s [id=rtb-0f469955ce9f75a5b]
module.vpc.aws_subnet.cache_private["a"]: Refreshing state... [id=subnet-020a1528fb6811865]
module.vpc.aws_subnet.cache_private["c"]: Refreshing state... [id=subnet-0e311376245111865]
module.vpc.aws_subnet.app_private[0]: Refreshing state... [id=subnet-00baf413a2852dade]
module.vpc_peering_mgmt[0].data.aws_route_tables.accepter: Read complete after 0s [id=ap-northeast-2]
module.vpc.aws_subnet.app_private[1]: Refreshing state... [id=subnet-0fa7a1288f6c802dc]
module.vpc.aws_subnet.data_private["a"]: Refreshing state... [id=subnet-09b53d0342ba93ae4]
module.vpc.aws_security_group.vpc_endpoints[0]: Refreshing state... [id=sg-0273fff56137933be]
module.vpc.aws_subnet.data_private["c"]: Refreshing state... [id=subnet-0444fbd5b939f20fe]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0715f9a3f6c4e5e13]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c389c9a08a8b7305]
module.vpc.aws_security_group.cache[0]: Refreshing state... [id=sg-0a3e64ea36fb48387]
module.vpc.aws_security_group.rds[0]: Refreshing state... [id=sg-032ac96144bbd5ec8]
module.vpc.aws_default_security_group.default: Refreshing state... [id=sg-0a1e15a05d6c880da]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0db7e97b1cc581f44]
module.vpc.aws_eip.internet[0]: Refreshing state... [id=eipalloc-07e62428bb63eca1e]
module.vpc.aws_eip.internet[1]: Refreshing state... [id=eipalloc-02566717ff42bb2d6]
module.vpc.aws_route.public_internet: Refreshing state... [id=r-rtb-0b847a4edf9d94f2d1080289494]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b4605bf73e2ffc7c"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0db7e97b1cc581f44"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b847a4edf9d94f2d"]: Reading...
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-06c24fbaedfb5360a"]: Reading...
module.eks.aws_security_group_rule.cluster_egress: Refreshing state... [id=sgrule-2026627799]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection_options.requester: Refreshing state... [id=pcx-0ae6e5066e4b085d3]
module.vpc_peering_mgmt[0].aws_vpc_peering_connection_options.accepter: Refreshing state... [id=pcx-0ae6e5066e4b085d3]
module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[0]: Refreshing state... [id=r-rtb-0f469955ce9f75a5b662290444]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0db7e97b1cc581f44"]: Read complete after 0s [id=rtb-0db7e97b1cc581f44]
module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[1]: Refreshing state... [id=r-rtb-000b539ccd4cb4e50662290444]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b4605bf73e2ffc7c"]: Read complete after 0s [id=rtb-0b4605bf73e2ffc7c]
module.s3_phase3[0].aws_s3_bucket_public_access_block.media[0]: Refreshing state... [id=kyeol-stage-media]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-0b847a4edf9d94f2d"]: Read complete after 0s [id=rtb-0b847a4edf9d94f2d]
module.s3_phase3[0].aws_s3_bucket_versioning.media[0]: Refreshing state... [id=kyeol-stage-media]
module.vpc_peering_mgmt[0].data.aws_route_table.accepter["rtb-06c24fbaedfb5360a"]: Read complete after 0s [id=rtb-06c24fbaedfb5360a]
module.s3_phase3[0].aws_s3_bucket_policy.media_cloudfront[0]: Refreshing state... [id=kyeol-stage-media]
module.s3_phase3[0].aws_s3_bucket_server_side_encryption_configuration.media[0]: Refreshing state... [id=kyeol-stage-media]
module.s3_phase3[0].aws_s3_bucket_ownership_controls.media[0]: Refreshing state... [id=kyeol-stage-media]
module.s3_phase3[0].aws_s3_bucket_policy.logs_tls[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_versioning.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_public_access_block.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_ownership_controls.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_lifecycle_configuration.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.s3_phase3[0].aws_s3_bucket_server_side_encryption_configuration.logs[0]: Refreshing state... [id=kyeol-stage-logs]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c75adeb8d364f47e]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0798988f211e202a1]
module.vpc.aws_route_table_association.cache_private["c"]: Refreshing state... [id=rtbassoc-0c472922c05cb2374]
module.vpc.aws_route_table_association.cache_private["a"]: Refreshing state... [id=rtbassoc-0dd6ac2a8c7cc7612]
module.vpc.aws_route_table_association.data_private["a"]: Refreshing state... [id=rtbassoc-0e2713f728b1146c5]
module.vpc.aws_route_table_association.data_private["c"]: Refreshing state... [id=rtbassoc-00bf951e0b42438e1]
module.vpc.aws_route_table_association.app_private[0]: Refreshing state... [id=rtbassoc-04bc7693c1b372b5a]
module.vpc.aws_route_table_association.app_private[1]: Refreshing state... [id=rtbassoc-0bd8edf452d27ca20]
module.vpc.aws_vpc_endpoint.ecr_api[0]: Refreshing state... [id=vpce-07536eddabf796809]
module.vpc.aws_vpc_endpoint.logs[0]: Refreshing state... [id=vpce-0ed360106d13a797d]
module.vpc.aws_vpc_endpoint.ecr_dkr[0]: Refreshing state... [id=vpce-04666cf9ae9d971dc]
module.vpc.aws_nat_gateway.regional[0]: Refreshing state... [id=nat-19c249784b0a0e57b]
module.vpc.aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-0c26d760707c483d3]
module.valkey[0].aws_elasticache_subnet_group.main: Refreshing state... [id=kyeol-stage-cache-subnet]
module.eks.aws_eks_cluster.main: Refreshing state... [id=kyeol-stage-eks]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=kyeol-stage-rds-subnet-group]
module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[0]: Refreshing state... [id=r-rtb-0b847a4edf9d94f2d1415821702]
module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[1]: Refreshing state... [id=r-rtb-0db7e97b1cc581f441415821702]
module.vpc.aws_route.private_nat[0]: Refreshing state... [id=r-rtb-0db7e97b1cc581f441080289494]
module.eks.data.tls_certificate.cluster[0]: Reading...
module.eks.aws_eks_node_group.general: Refreshing state... [id=kyeol-stage-eks:kyeol-stage-ng-general]
module.eks.aws_eks_addon.cloudwatch_observability: Refreshing state... [id=kyeol-stage-eks:amazon-cloudwatch-observability]
module.rds.aws_db_instance.main: Refreshing state... [id=db-UVITHAUUKW6CKKRBYPH2OEOKXU]
module.rds.aws_secretsmanager_secret_version.rds: Refreshing state... [id=arn:aws:secretsmanager:ap-northeast-2:827913617839:secret:kyeol-stage-rds-creds-934c9f61-raBX7Z|terraform-2026011301183071570000000a]
module.valkey[0].aws_elasticache_replication_group.main: Refreshing state... [id=kyeol-stage-cache]
module.eks.data.tls_certificate.cluster[0]: Read complete after 1s [id=2f4c12273dfce0668da79492f884c5b681951fb9]
module.eks.aws_iam_openid_connect_provider.cluster[0]: Refreshing state... [id=arn:aws:iam::827913617839:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/EC3C36350CAC3CE0A1C05048A34244E6]
module.eks.aws_iam_role.fluent_bit[0]: Refreshing state... [id=kyeol-stage-fluent-bit-role]
module.eks.aws_iam_role.external_dns[0]: Refreshing state... [id=kyeol-stage-external-dns-role]
module.eks.aws_iam_role.alb_controller[0]: Refreshing state... [id=kyeol-stage-alb-controller-role]
module.eks.aws_iam_role_policy.fluent_bit[0]: Refreshing state... [id=kyeol-stage-fluent-bit-role:kyeol-stage-fluent-bit-policy]
module.eks.aws_iam_role_policy.external_dns[0]: Refreshing state... [id=kyeol-stage-external-dns-role:kyeol-stage-external-dns-policy]
module.eks.aws_iam_role_policy.alb_controller[0]: Refreshing state... [id=kyeol-stage-alb-controller-role:kyeol-stage-alb-controller-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.eks.aws_eks_node_group.general will be updated in-place
  ~ resource "aws_eks_node_group" "general" {
        id                     = "kyeol-stage-eks:kyeol-stage-ng-general"
      ~ tags                   = {
            "Environment"                               = "stage"
            "ManagedBy"                                 = "terraform"
            "Name"                                      = "kyeol-stage-eks-node"
            "Project"                                   = "kyeol"
            "Team"                                      = "msp-team3"
          + "k8s.io/cluster-autoscaler/enabled"         = "true"
          + "k8s.io/cluster-autoscaler/kyeol-stage-eks" = "true"
        }
      ~ tags_all               = {
          + "k8s.io/cluster-autoscaler/enabled"         = "true"
          + "k8s.io/cluster-autoscaler/kyeol-stage-eks" = "true"
            # (5 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)

      ~ scaling_config {
          ~ max_size     = 5 -> 6
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_role.cluster_autoscaler[0] will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ap-northeast-2.amazonaws.com/id/EC3C36350CAC3CE0A1C05048A34244E6:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ap-northeast-2.amazonaws.com/id/EC3C36350CAC3CE0A1C05048A34244E6:sub" = "system:serviceaccount:kube-system:cluster-autoscaler"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::827913617839:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/EC3C36350CAC3CE0A1C05048A34244E6"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "kyeol-stage-cluster-autoscaler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kyeol-stage-cluster-autoscaler-role"
          + "Project"     = "kyeol"
          + "Team"        = "msp-team3"
        }
      + tags_all              = {
          + "Environment" = "stage"
          + "ManagedBy"   = "terraform"
          + "Name"        = "kyeol-stage-cluster-autoscaler-role"
          + "Project"     = "kyeol"
          + "Team"        = "msp-team3"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks.aws_iam_role_policy.cluster_autoscaler[0] will be created
  + resource "aws_iam_role_policy" "cluster_autoscaler" {
      + id          = (known after apply)
      + name        = "kyeol-stage-cluster-autoscaler-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/enabled"         = "true"
                              + "autoscaling:ResourceTag/k8s.io/cluster-autoscaler/kyeol-stage-eks" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeImages",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "eks:DescribeNodegroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.eks.helm_release.cluster_autoscaler[0] will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + verify                     = false
      + version                    = "9.37.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "kyeol-stage-eks"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "awsRegion"
          + value = "ap-northeast-2"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.balance-similar-node-groups"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.expander"
          + value = "least-waste"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-delay-after-add"
          + value = "10m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-enabled"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-unneeded-time"
          + value = "10m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-local-storage"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-system-pods"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.stderrthreshold"
          + value = "info"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.v"
          + value = "4"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "image.repository"
          + value = "registry.k8s.io/autoscaling/cluster-autoscaler"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "image.tag"
          + value = "v1.33.0"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "podDisruptionBudget.maxUnavailable"
          + value = "1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "priorityClassName"
          + value = "system-cluster-critical"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.create"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "cluster-autoscaler"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "resources.limits.cpu"
          + value = "100m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "resources.limits.memory"
          + value = "300Mi"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "resources.requests.cpu"
          + value = "100m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "resources.requests.memory"
          + value = "300Mi"
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "accepter_to_requester" {
      - destination_cidr_block      = "10.40.0.0/16" -> null
      - id                          = "r-rtb-0b847a4edf9d94f2d1415821702" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-0b847a4edf9d94f2d" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.accepter_to_requester[1] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "accepter_to_requester" {
      - destination_cidr_block      = "10.40.0.0/16" -> null
      - id                          = "r-rtb-0db7e97b1cc581f441415821702" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-0db7e97b1cc581f44" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.accepter_to_requester["rtb-0db7e97b1cc581f44"] will be created
  + resource "aws_route" "accepter_to_requester" {
      + destination_cidr_block    = "10.40.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + region                    = "ap-northeast-2"
      + route_table_id            = "rtb-0db7e97b1cc581f44"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-0ae6e5066e4b085d3"
    }

  # module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[0] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "requester_to_accepter" {
      - destination_cidr_block      = "10.20.0.0/16" -> null
      - id                          = "r-rtb-0f469955ce9f75a5b662290444" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-0f469955ce9f75a5b" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.requester_to_accepter[1] will be destroyed
  # (because resource does not use count)
  - resource "aws_route" "requester_to_accepter" {
      - destination_cidr_block      = "10.20.0.0/16" -> null
      - id                          = "r-rtb-000b539ccd4cb4e50662290444" -> null
      - origin                      = "CreateRoute" -> null
      - region                      = "ap-northeast-2" -> null
      - route_table_id              = "rtb-000b539ccd4cb4e50" -> null
      - state                       = "active" -> null
      - vpc_peering_connection_id   = "pcx-0ae6e5066e4b085d3" -> null
        # (13 unchanged attributes hidden)
    }

  # module.vpc_peering_mgmt[0].aws_route.requester_to_accepter["rtb-000b539ccd4cb4e50"] will be created
  + resource "aws_route" "requester_to_accepter" {
      + destination_cidr_block    = "10.20.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + region                    = "ap-northeast-2"
      + route_table_id            = "rtb-000b539ccd4cb4e50"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-0ae6e5066e4b085d3"
    }

Plan: 5 to add, 1 to change, 4 to destroy.

Warning: Deprecated attribute

  on ../../modules/eks/cluster_autoscaler_helm.tf line 27, in resource "helm_release" "cluster_autoscaler":
  27:     value = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 12 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**변경관리 추적 링크:** [Actions Run #15](https://github.com/MSP-Team3/kyeol-infra-terraform/actions/runs/21161282959)
